Revit 2027 API
SymbolTypeId.Kip Property
 Symbol kip, indicating unit Kips.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Kip { get; }
Public Shared ReadOnly Property Kip As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Kip {
	ForgeTypeId^ get ();
}
static member Kip : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace